{
	"resume": {
		"contact" : {
			"first_name": "Yongjun",
			"last_name": "Rong",
			"website": "",
			"email": "rongyj@hotmail.com",
			"github": "",
			"city": "Cherry Hill, NJ, USA, 08003"
		},
		"education": [
			{
				"item-education": {
					"start-date": "2002-09",
					"end-date": "Jun.2006",
					"institution": {
						"name": "Texas Tech University",
						"city": "Lubbock, TX",
						"country": "USA"
					},
					"description": "Master of Computer Science",
					"additional-info": "GPA: 4.0"
				}
			},
			{
				"item-education": {
					"start-date": "1993-09-01",
					"end-date": "Feb.1996",
					"institution": {
						"name": "Shanghai JiaoTong University",
						"city": "Shanghai",
						"country": "China"
					},
					"description": "Master of Engineering",
					"additional-info": "Speciality: Hydraulic Fluid Control in Mechanical Engineering"
				}
			},
			{
				"item-education": {
					"start-date": "1987-09-03",
					"end-date": "Jul.1991",
					"institution": {
						"name": "Changsha Railway University",
						"city": "Changsha, Hunan",
						"country": "China"
					},
					"description": "Bachelor of Engineering",
					"additional-info": "Speciality: Engineering Machine"
				}
			}
		],
		"work": [
			{
				"item-work": {
					"start-date": "May, 2014",
					"end-date": "Current",
					"position": "Lead Software Engineer",
					"company": {
						"name": "Oracle",
						"city": "Redwood, CA (WFH@NJ)",
						"country": "USA "
					},
					"achievements": "The Cloud Connectivity software engineering team is responsible to develop the Cloud Integration Connectivity SDK and Java Connectors which enable the SOA Suite and Oracle Integration Cloud Service (ICS) connectivity to any Oracle internal or external SaaS or On-Premises Enterprise Applications.",
					"technologies": [
					],
					"projects": [
						{
							"item-projects": {
								"title": "Docker Swarm/Compose/Stack Development and CI Test Environment for  Cloud SDK/APIs/Connectors",
								"description":"Research and prototype the docker containers, compose and swarm technologies to help developer setup complex testing services stack and improve CI testing environments for the SDK/APIs and Java Connectors. ",
								"highlights":[
									"Implemented complex Docker containers network with Overlay and MACVLAN drivers ",
									"Created Dockerfiles to build WebLogic docker images with different external modules and libraries",
									"Built Docker Hosts in Oracle Cloud VMs, Amazon EC2 and local VirtualBox by using Docker Machine",
									"Designed and built the pool of Docker Cluster Environment by using Docker Swarm",
									"Created Docker Stack file and deploy the service stack for multiple microservices",
									"Developed docker-compose.yml files with extending services for the full service stack including dependency Web Services, DBMS, NoSQL and JMS",
									"Researched and prototyped the Docker Swarm and Docker Compose integration"
								],
								"technologies": [ "Docker", "Docker Machine", "Docker Compose", "Docker Swarm","Docker Stack", "Docker CLI (Rest APIs)",
									 "Weblogic", "Oracle Cloud VMs", "Amazon EC2", "JMS", "NoSQL (Cassandra)",
									"DBMS (MySQL and PostgreSQL)"
								],
								"tags":["devops","cloud","infrastructure","platform","containers"]
							}
						},
						{
							"item-projects": {
								"title": "Cloud integration connectivity SDK and Java Connectors",
								"description":"The Cloud Integration Connectivity SDK and Java Connectors are built on the top of the Connector Architecture in the Award winning Oracle SOA Suite. It provides the plugin connectivity to any SaaS and On-Premises Enterprise Applications for the Oracle Integration Cloud Service and SOA Suite.",
								"highlights":[
									"Design and implement the WSDL regeneration framework by rebuilding the internal data model (DOM) from the persisted integration flow artifacts files (JCA, WSDL and XSD) and the remote custom data",
									"Design and implement new APIs for the SDK to provide cache and pagination abilities for the backend persistent layer",
									"Design and implement NLS and localization framework for displayable strings within the SDK",
									"Troubleshoot the WSDL/XSD generation issues related to complex mixing namespaces and prefixes",
									"Develop utility methods to handle the namespaces and prefixes conflicts while combining the importing schema to the same WSDL file",
									"Develop recursive logic to follow the XML element types to embed the undefined data structure if it has the same target namespace or create new schema if it has different target namespace",
									"Dynamically and Programmatically generate or regenerate the simplified integration WSDL from large set of source WSDL, schema XSD files and fresh custom data by using XDK/JAXP/WSDL4J/DOM",
									"Programmatically manipulate the single WSDL file generation from the source WSDL and schema XSD files with external schema file importing",
									"Programmatically handle the anonymous Complex and Simple XSD type for the integration WSDL generation and regeneration",
									"Design and test Oracle RCU DB descriptive XML files for new DB tables/sequences with primary and foreign keys",
									"Worked together with different connector development teams to joint debug the WSDL regeneration related issues",
									"Train and transfer knowledge for the WSDL regeneration framework to geographically distributed connector development teams"
								],
								"technologies": [ "Java","SOA","SOAP/REST","WSDL/JSON","XML","XML Schema","API","SDK","IaaS","RCU","JCA","XDK","JAXP","WSDL4J",
									"DOM","WS-Security","Jersey REST/JSON","MVC","ADF","NLS/L10","Oracle DB","Jira","Agile",
									"ADE","GIT","Maven","Junit","XMLUnit","SoapUI","OSC","ERP","HCM","RightNow"],
								"tags":["Java","Enterprise Applications Integration","Web Services", "SDK", "API", "SOA"]
							}
						},
						{
							"item-projects": {
								"title": "Oracle Fusion Applications (FA) Business Event Connector Framework",
								"description":"The business event connector framework provides the abilities to auto-discover the FA (OSS/ERP/HCM) business events (including custom events), set event filtering conditions, subscribe to interesting business event and expose the SOAP web service as the event listener through the ICS web/JDeveloper design time UI. This event connector framework enables the Fire-and-Forget/ Asynchronous Response and Publish/Subscribe integration pattern for Business Integration",
								"highlights":[
									"Design and implement the business event connector for FA (OSC/ERP/HCM)",
									"Build the design time web UI using the Oracle Web UI SDK which is building on the top of ADF",
									"Design and Implement the Business Event Connector Runtime  ",
									"Programmatically manipulate the payload to align with the changed schema in the integration WSDL  ",
									"Design and implement the custom event based on the generic event concepts ",
									"Programmatically replace the xsi:anyType generic object type with the concrete object type selected by the end user from the web UI"
								],
								"technologies": ["Java","FA","OSC/ERP/HCM","WSDL/SOAP","REST","JSON","XSI","XML Schema","XDK","JAXP",
									"WSDL4J","DOM","WS-Security","Jersey REST/JSON","MVC","ADF","ADE","Maven","Junit","XMLUnit","SoapUI"],
								"tags":["Java","Enterprise Applications Integration","Event"]
							}
						}
					]
				}
			},
			{
				"item-work": {
					"start-date": "Oct. 2010",
					"end-date": "Apr. 2014",
					"position": "Senior Infrastructure Automation Engineer",
					"company": {
						"name": "Comcast T&P",
						"city": "Philadelphia, PA",
						"country": "USA"
					},
					"achievements": "BITT(Build Integration Test Team) or DevOps provide development operation support for multiple development teams and supporting the developers for SDLC infrastructure system design/implementation, and Build/Release/Deployment/SCM/CI automation. As a senior engineer in the team, design, develop and implement the AutoBuild system, OpenSource performance monitoring system for the SDLC systems, two steps bare-metal Linux bootstrap system for HP servers, Linux HA Clusters for SCM/Maven/CI/Crowd servers, Ruby/Rails software system maintenance and improvement. Manage the SCM(Gerrit/Subversion), CI(Bamboo) and maven repo (Nexus and Artifactory) system. Design and development automation scripts (bash/ruby) to improve work efficiency. Lead and Train junior team members.",
					"technologies": [
					],
					"projects": [
						{
							"item-projects": {
								"title": "AutoBuild System",
								"description":"Automate the branching/tagging process and improve the work efficiency from 3 days to 1 day for more than 100 projects. Using maven versions plugin and maven repo REST API to automatically detect the latest snapshot and released dependency version and update pom.xml automatically. The cut tag script can cut a bug-fixing tag for the bug-fixing patch within 5 minutes.",
								"highlights":[
									"Design and implement the error handling and logging system for ruby bash commands",
									"Implement build dependency graph and tree using RGL for more than 200 projects",
									"Refactoring autoBuild to adapt to much large organization development practices",
									"Design and implement the whole AutoBuild system",
									"Using ruby and bash scripts wraps multiple manual steps to automate the whole branching and tagging process",
									"Modify maven versions plugin to fix the bug which cannot update the dependency version property variables and the bug which cannot update the latest snapshot version to the latest released version",
									"Detect and update the dependency versions in pom.xml automatically using maven versions plugin and maven repo servers REST API",
									"Design and implement the branching/tagging process",
									"Design code standards and rule to follow AutoBuild conventions for developers",
									"Apply convention over configuration for AutoBuild system",
									"Develop ruby scripts to post json message to a BOM management system to allow the artifacts ready to deploy",
									"Develop automation script to post message to Jira and Confluence page using Atlassian Jira-cli and Confluence-cli",
									"Develop bamboo scripts using bamboo command-cli to create plans from git/svn repos automatically",
									"Install and configure Bamboo, Nexus, Artifactory, Crowd/OpenID, Gerrit and Subversion servers.",
									"Maintain Ruby/Rails BOM management system",
									"Using and configuring maven release, versions, toolchains, dependency…etc. plugins "
								],
								"technologies": ["Ruby/Rails","gems","Bash","Maven","GIT","SVN","Bamboo/Jira/Confluence CLI",
									"Nexus/Artifactory REST/XML","SDLC","CI/CD","Gerrit/Subversion","MySQL/PostgreSQL","Crowd/OpenID","Capistrano"],
								"tags":["devops","automation","CI","CD"]
							}
						},
						{
							"item-projects": {
								"title": "Performance Monitoring System",
								"description":"The performance monitoring system collects JMX, splunk and OS metrics and display stats graphs for all different kinds of metrics for JVM heaps, threads and OS CPU/Disk/Memory usage and IO throughputs. Using open source projects and modify ruby/scala/java/python tools to integrate all different projects into one performance monitoring system, the system helps to detect the performance bottlenecks.",
								"highlights":[
									"Helped design the whole monitoring system using open source projects such as graphite, gdash, metricsd, stated, jmxtrans and god...etc.",
									"Developed UDP metrics connectors and ruby splunk searcher to collect splunk stats",
									"Using java, scala modify open source project jmxtrans, metricsd to use UDP",
									"Develop Capistrano task to dynamically generate gdash templates for the metrics graphs and jmxtrans configuration files.",
									"Using open source god project to manage the ruby processes",
									"Modify open source project jmxsh to be able to list the jmx attributes"
								],
								"technologies": [ "Metrics","graphite","jmx","splunk","ruby","splunk-ruby-SDK",
									"performance monitoring","UDP","Capistrano","god","bash","gdash","graphite","statsd","metricsd"],
								"tag":["devops","monitoring"]
							}
						},
						{
							"item-projects": {
								"title": "Two Steps bare-metal Linux bootstrap system for HP Servers",
								"description":"This system bootstrap the bare-metal HP box to automatically install and configure CentOS 6. First, it boots the HP bare-metal box to the HP-Toolkit via tftp/pxe to setup BIOS configuration, collect the mac address, add DHCP host section with static ip and add new cobbler system using customized cobbler xmlrpc bash client. Second, it boots the bare-metal box to get the static DHCP IP and tftp/pxe to the cobbler profile to install and configure CentOS 6 automatically.",
								"highlights":[
									"Design the two steps bootstrap system using tftp/pxe/dhcp and cobbler",
									"Statically build netstat tool using make/gcc to run it in HP-Toolkit with limited dynamic libraries",
									"Developed a XMLRPC bash client to remotely connect back to the cobbler server to add a new system from the bare-metal box during the first boot",
									"Modify the bootstrap script for the first boot to collect the mac-address and parse a boot configure file to add a new system to cobbler server.",
									"Physically upgrade the memory, disks and fusion IO adapter for HP blade servers",
									"Setup ILO and IPMI",
									"Configure disk-array and virtual storage management (lvm, pv and vg..etc.)"
								],
								"technologies": [ "TFTP","PXE","DHCP","DNS","cobbler","RPC","xml","bash","ILO 3","IPMI","LVM","HP Servers","CentOS 6"],
								"tags":["devops","automation"]
							}
						},
						{
							"item-projects": {
								"title": "Linux HA for SCM(Gerrit) /Maven Repo (Artifactory/Nexus) Servers",
								"description":"The two nodes Linux HA cluster is for SCM(Gerrit) / Maven Repo(Artifactory and Nexus) master/slave failover system. Using pacemaker/corosync/cman or keepalived/haproxy, it setup Gerrit, artifactory/Nexus master/slave automatically failover cluster with PostgreSQL/RAC and GFS2 over SAN / DRBD as backend DBMS and distributed file system.",
								"highlights":[
									"Design Linux HA master/slave failover cluster for Gerrit, Artifactory.",
									"Configure pacemaker/corosync/cman for two-nodes cluster",
									"Create Pacemaker resources and constraints for the services using pcs",
									"Setup and configure  keepalived and haproxy for Nexus, artifactory",
									"Setup Distributed filesystem GFS2 over SAN(Multipath) and DRBD",
									"Developed keepalived check scripts for Nexus and artifactory",
									"Setup PostgreSQL master/slave cluster over SAN",
									"Setup LVM over SAN",
									"Setup OpenID authentication for Gerrit",
									"Setup Gerrit cluster over SAN and PostgreSQL",
									"Setup Artifactory Cluster over SAN and RAC",
									"Setup Nexus Cluster via replication scripts with rsync",
									"Setup Gerrit OpenID authentication with Atlassian crowd backend with Multiple LDAP servers"
								],
								"technologies": ["Pacemaker","Corosync","Cman","Keepalived","HAProxy","GFS2","DRBD","SAN","Gerrit","Artifactory","Nexus","PostgreSQ","OpenID","LDAP","Crowd"],
								"tags":["devops","Linux HA", "Platform","Clustering"]
							}
						},
						{
							"item-projects": {
								"title": "Automation scripts and tools",
								"description":"Develop and use scripts (Ruby/bash) and tools to automate the build/release/deploy process to improve the work efficiency.",
								"highlights":[
									"Develop migration tools to migrate git repos from different remote git repos(Gerrit, stash and gitorious) to new Gerrit server",
									"Develop scripts to find the largest commit object and rewrite git history to improve git performance",
									"Develop Gerrit/git hooks for rally and jira",
									"Develop multiple automation tools using confluence, jira and bamboo CLI",
									"Developed tools to automatically build the source dependency tree and branch/tagging parallel",
									"Maintain configuration management tool Capistrano and automate the environment and service configuration ",
									"Using Puppet to automate the system level configuration",
									"Developed Nexus replication scripts from master to slave automatically with keepalived "
								],
								"technologies": ["Ruby","Bash","Capistrano","Jira/Rally","Bamboo/Confluence","Git/Gerrit","puppet","Nexus replication","REST/XML"],
								"tags":["devops","automation"]
							}
						},
						{
							"item-projects": {
								"title": "CoreOS and Docker prototyping and testing",
								"description":"Using docker and CoreOS to dynamically create development and integration test environment on demand for each developer by launch a set of docker LXC with haproxy as the internal load balancer",
								"highlights":[
									"Helped design and implement the docker LXC system",
									"Setup CoreOS stateful and stateless using pxe image via cobbler and tftpboot/DHCP",
									"Create Docker images for CentOS/Java/Ruby/Haproxy",
									"Create ruby Capistrano tasks to dynamically provision docker instances with haproxy as the internal LB on demand",
									"Automate the dynamic deployment and provisioning process by using docker rest API and tools"
								],
								"technologies": ["CoreOS","Docker","Ruby","REST","LXC","cobbler","pxe","tftpboot","DHCP"],
								"tags":["devops","Docker","CI/CD","cloud"]
							}
						},
						{
							"item-projects": {
								"title": "SDLC process management and junior team member training and mentoring",
								"description":"Design and Manage the SDLC process to build/release/deploy more than 100 projects to maven repo/CI/Integration Test environments. Maintain the maven repo servers(Nexus and artifactory clusters), CI (Bamboo), SCM (Subversion and Git/Gerrit) and clustering integration environments.Identify and troubleshooting the build/release/deploy issues. Training, guiding and mentoring junior team member.",
								"highlights":[
									"Help to design and identify the build/release/deploy and configuration management strategies",
									"Design standard development and code standards for developers to follow the autoBuild process.",
									"Using Capistrano to manage deployment configuration for different environments(Dev, QA, Staging and Prod..etc.)",
									"Communicate with developers to figure out the build/release issues",
									"Troubleshooting build/release and configuration issues",
									"Lead small team to develop autoBuild system using agile methodology",
									"Train and guide new team member",
									"Write confluence pages for documents",
									"Presents to other team members in brown bag session",
									"Transfer knowledge to other team member ",
									"Administration the SCM/CI/Maven Repos clustering environments and SDLC tools",
									"Research and design github enterprise branch/release process",
									"Develop scripts to build dependency graphs and design algorithm to simplify it to dependency tree for more than 150 projects (git repos)"
								],
								"technologies": ["SDLC","SCM","Git/Subversion","GIT Hooks","Ruby","Bash","Confluence","Jira","Agile"],
								"tags":["devops","Docker","CI/CD","SDLC"]
							}
						}
					]
				}
			},
			{
				"item-work": {
					"start-date": "Nov. 2006",
					"end-date": "Oct., 2010",
					"position": "Senior Software Engineer",
					"company": {
						"name": "Boomi Inc.",
						"city": "Berwyn, PA",
						"country": "USA"
					},
					"achievements": "As the market and technology leader in on-demand integration, Boomi is the industry’s first and leading integration platform-as-a-service and a two-time SIIA CODiE award winner — Best Application Integration Solution (2010) and Best On-Demand Platform (2009).",
					"technologies": [
					],
					"projects": [
						{
							"item-projects": {
								"title": "Boomi  On-Demand Business Integration Service",
								"description":"A Large On-Demand integration service-oriented (SOA) system helps to visually design the business integration process using Rich Internet Application (RIA), automatically deploy to distributed run-time engines based on REST/XML style.  The run-time engine named “atom” contains all the components required to execute an integration process from end-to-end including connectors, transformation rules, decision handling and processing logic. The software is delivered as a SaaS system based on web 2.0 technologies with zero installation and zero coding.",
								"highlights":[
									"Design and implement synchronous/asynchronous message framework using XML/JAXB/REST/HTTP",
									"Design and implement dynamic reflection invocation connector framework using dynamic proxy and customized class loading to failover from local file system to remote webserver",
									"User Management Subsystem (PKI certificate token based authentication and authorization)",
									"Design and implement connectors to desktop accounting systems (QuickBooks, MAS 90, MS Dynamics Great Plains, Peachtree), ERP systems (MAS 500, SAP, MS Dynamics Navision, MS Dynamics CRM on-premise 4.0 and Online) and SaaS system ( Parature, AutoTask).",
									"Design and implement Java to COM/DCOM/COM+/ .NET/WCF integration subsystem",
									"Migrating data processing, mapping function …etc. modules from previous non-SOA version",
									"Design and develop rich internet UI using openlaszlo",
									"Design and deploy the load balancing and clustering SOA system in OpSource and Rackspace data center",
									"Deploy SOA system in Amazon’s EC2 and S3",
									"Multiple threads concurrent subsystem design and implementation",
									"Design and implement distributed cache in cluster using ehcache",
									"Develop, build, deploy and release projects using IDEA, maven, subversion and TeamCity",
									"Tracking bugs/Issues and interacting with QA/Support team using Jira Enterprise",
									"Using confluence page to document ideas and functional design",
									"Participate in agile development with scrum framework"
								],
								"technologies": ["Java","XML","XSD","JAXB","REST","HTTP","Hibernate","openlaszlo","SSL","PKI","com4j",".NET 3.0/2.0/1.1","COM/DCOM","Linux","QBXML","eConnect","servlet","Jetty","IDEA","Maven","subversion","Confluence","Jira","MySQL","RAID","SQL server","QuickBooks 2005","Sage MAS 90/200/500","MS Dynamics GP 9.0/10.0/2010","SOA"],
								"tags":["Java","Javascript","FullStack","EAI","cloud"]
							}
						},
						{
							"item-projects": {
								"title": "Boomi On Demand Clustering Production Environment",
								"description":"Distributed clustering production environment with ten 64-bits Redhat Enterprise Linux servers, Clustering MySQL DB servers, SAN and NFS is hosted in Rackspace and OpSource.",
								"highlights":[
									"Plan, Design and setup the clustering SOA production environment in OpSource and Rackspace",
									"Maintain, build  and release the QA/production environment.",
									"Migration of the production environment, application and MySQL DB data from OpSource to Rackspace",
									"Setup and configure Apache Solr searching and indexing server",
									"Create cron jobs and shell scripts to monitor hosted AtomSphere environment",
									"Setup newrelic monitoring environment",
									"Research and proto-type cluster solutions for the large SOA system.",
									"Design distributed cache system using ehcache to reduce the DB access traffic from front end.",
									"Design and implement the dynamic http polling algorithm on the front end to reduce the possibility of the suppress storm requests.",
									"Using comet, jetty continuation to design an asynchronous http push (long polling) events system.",
									"Using worker-stealing algorithm to design and implement an Apache solr indexing cluster with large throughput transactions (millions per day)",
									"Research and proto-type MySQL clustering technologies",
									"Setup and configuration Jetty and Openlaszlo clustering system (NFS sharing) ",
									"Communicate with Rackspace support engineers with their tickets system to tracking issues ",
									"Design, implement and troubleshooting Apache solr out of memory and DB table transaction lock and response time vibration problem.",
									"Using Sun JVM troubleshooting utilities (visualVM, jmap, jstat,..etc.) to investigate the heap new generation and old generation usage",
									"Tuning heap size and GC algorithm parameters to solve the out of memory issue",
									"Collect response time statistics data to diagnose software system vibration",
									"Using Unix vmstat, top,...etc. to investigate the File system IO, CPU usage"
								],
								"technologies": ["64-bits Redhat Enterprise Linux","MySQL clustering","Apache","PHP","Jetty","64 bits Java","Apache Lucene/ Solr","Openlaszlo","distributed cache","distributed and parallel algorithm","ehcache","comet","continuation","DWR","JVM tuning","jmap","jstat","Sun JVM Heap","GC","vmstat"],
								"tags":["devops","platform","Linux","Java", "JVM","GC","Clustering","Peformance Monitoring"]
							}
						},
						{
							"item-projects": {
								"title": "Desktop Accounting and ERP Enterprise Applications Integration (EAI)",
								"description":"Solutions integrating with some popular desktop accounting software (QuickBooks, MS Dynamics Great Plains, Sage Peachtree and Sage Simply Accounting,), and ERP(SAP, Oracle e-Business, PeopleSoft, JD Edwards and Siebel, MS Dynamics Navision, MS Dynamics CRM On-premise 4.0 and online) are developed to import and export business data using their related popular SDKs and APIs.",
								"highlights":[
									"Integrate QuickBooks (US, UK, Canada 2002-2008,) and QuickBooks Online Edition using the QBXML request processor.",
									"Integrate Microsoft Dynamics Great Plains (9.x, 10.x and 2010) using eConnect (9.x, 10.x and 11) and WCF.",
									"Integrate Microsoft Dynamics CRM on premise (3.0 and 4.0) and online using Web Services with NTLM authentication and windows live ID authentication ",
									"Develop integration solution for Sage Peachtree Accounting system using its’ Import/Export engine API",
									"Integrate with ERP (SAP, Oracle e-Business, PeopleSoft, JD Edwards and Siebel) using netmanage's Librados API.",
									"Setup QuickBooks, Sage Peachtree, MS Dynamics GP desktop accounting system for testing",
									"Setup Dynamics CRM 4.0 in EC2 windows server 2008 domain environment for testing",
									"Research integration with QuickBooks POS system",
									"Research integration with Sage Software (MAS 90/200, 500 ERP, Simply, Accpac ERP).",
									"Research integration solution with Microsoft Dynamics Navision 4.0, 5.0 and 2009 using XMLPort, .NET Web services and Communication Components with windows socket bus adapter."
								],
								"technologies": ["QBXML RequestProcessor","Microsoft eConnect 9.x/10.x/11","Librados","SAP R3","BAPI","REST/XML","COM/COM+/DCOM",".NET","MS Dynamics Navision","MS Dynamics CRM","SOAP/WSDL","WCF","XMLPort","C/AL","CodeUnits"],
								"tags":["Java","EAI",".NET"]
							}
						},
						{
							"item-projects": {
								"title": "Amazon EC2 and S3 SOA HA Environment",
								"description":"Three EC2 instances including two web instances as a cluster and one DB ( MySQL 5.x) instance, which is installed and configured with Apache open source search server solr and Apache httpd load balancer, are configured in Amazon web service virtual environment.",
								"highlights":[
									"Install and setup the Amazon EC2 client security (PKI token based authentication), commands and AMI tools",
									"Setup Amazon EC2 large/small Linux/windows server instance with static IP address and EBS.",
									"Install and configure two Jetty instances (Web UI + App server) in EC2 instance (Fedora 7)",
									"Setup Apache httpd load balancer (mod_proxy_ajp and mod_proxy_balancer) for jetty 6.1.x",
									"Setup NFS server and client to share data between two EC2 instances",
									"Install MySQL 5.x server, create DB user, grant privileges and replicate the data.",
									"Install and configure Solr in Jetty 6.x and create startup script",
									"Create Jetty startup script to create log directory and grant permissions to the running users.",
									"AMI bundles and images maintenance (create AMI bundles and upload it to S3, register AMI, remove AMI from S3).",
									"Rescue the broken AMI (Download AMI bundles from S3, unbundle and mount it as loop device).",
									"Setup EC2 security group and firewall.",
									"Troubleshooting EC2 instance network and AMI booting problems",
									"Troubleshooting timeout and performance problem",
									"Setup Fedora 6/7/8 x86_64 EC2 large instance with Apache, MySQL",
									"Troubleshooting MySQL 5.x 64-bit access denied problem",
									"Troubleshooting MySQL 5.x  performance (table lock timeout and setup the right isolation level)",
									"Configure distributed cache for the HA cluster using ehcache",
									"Setup EBS for the HA cluster",
									"Setup Rightscale auto-deploy scripts to start EC2 instance with Boomi AtomSphere built-in. ",
									"Setup Windows Server 2008 domain environment with SQL Server ",
									"Implement cron job and shell scripts to backup EC2 instance data and EBS snapshot to S3"
								],
								"technologies": ["Fedora 6//7/8","EC2","S3","Jetty 6.x/7.x","MySQL 5.x","Apache httpd 2.x  and Solr 1.3.x/1.4.x","NFS","shell script(bash and sh)","ehCache","cron"],
								"tags":["devops","cloud","platform","infrastructure", "MySQL", "DB Administration"]
							}
						},
						{
							"item-projects": {
								"title": "Setup Development, Build and Deployment Environment for QA, Staging and Production Environment",
								"description":"Setup java, maven, subversion development, TeamCity build environment and Apache ant release xml, shell scripts and PHP scripts to maintain the user accounts.",
								"highlights":[
									"Install and configure java, maven and subversion.",
									"Install and configure MySQL 5.x, PHP5.x, Jetty 6.x, openlaszlo, quartz and Apache solr.",
									"MySQL 5.x administration (create database, create user, grant permission and populate data)",
									"Create Jetty startup script and DB update SQL script",
									"Upgrade MySQL DB Structure",
									"Using TeamCity create deploy and release projects",
									"Create PHP scripts connecting to MySQL DB to maintain user accounts",
									"Create unix shell scripts and Apache ant xml to release to QA, Staging and Production environment"
								],
								"technologies": ["Maven 2.x","subversion","TeamCity","PHP 5.x","Apache Http server 2.3","Apache Ant","MySQL5.x","Jetty 6.x","Openlaszlo 3.4","Apache Solr","Fedora 8"],
								"tags":["devops","Java","platform","Lucene","cloud","SDLC", "Linux"]
							}
						},
						{
							"item-projects": {
								"title": "Research virtualization technology and implement Virtual Machines using VMware server and workstation",
								"description":"Researching and comparing current popular virtualization and paravirtualization technologies like VMware, Xen, Microsoft Virtual PC and implementing Virtualization Environments using VMware Workstation 6.x and Server 1.x. Performance diagnostics and tuning in Linux and VMware Environment.",
								"highlights":[
									"Research, compare and evaluate VMware workstation 6.2, VMware server 1.4 and Microsoft Virtual PC.",
									"Install and Configure VMware Workstation 6.2, VMware Server 1.4, VMware Server Console.",
									"Adding new hard disk to Logic Volume Group (pvcreat, vgextend, lvcreate,mke2fs) ",
									"Using top, vmstat, iostat and sar and some benchmark tools(dbench, unicbench) to diagnostics the Linux system performance",
									"Upgrade Dell and LSI RAID Controller BIOS firmware and Seagate SCSI Hard disk driver",
									"Tuning Disk I/O performance via distributing the VM disk to different partition",
									"Install and setup VNC server and client on Linux",
									"Install and configure subversion 1.4, Maven 2.x, PHP5.x, Apache Httpd 2.x, MySQL 5.x."
								],
								"technologies": ["Virtualization","paravirtualization","VMware Workstation 6.2 and VMware Server 1.4","Xen","Microsoft Virtual PC","Fedora 8","RAID","SMP","Performance tuning","Subversion","Maven","PHP","MySQL"],
								"tags":["devops","cloud","VmWare", "platform","linux"]
							}
						},
						{
							"item-projects": {
								"title": "Java to C/C++, DLL, COM/COM+/DCOM/.NET Integration",
								"description":"Using JNI, JNA, Com4j, ikvm, java application can be seamlessly integrated with c/c++ win32 DLLs, COM/COM+/DCOM Objects and .NET assemblies.",
								"highlights":[
									"Research and evaluate open source technologies such as com4j, JNBridge, ikvm, etc. for java-com and java-.net integration",
									"Develop prototype application using the Microsoft Visual Studio 6.0, 2003 and 2005 (C# and VB) ",
									"Configure COM/COM+/DCOM/.NET run time environment (regsvr32, dcomcnfg, gacutil, regasm, ..etc.)",
									"Develop java to win32 DLL application using JNA (Java Native Access)",
									"Develop java to COM/COM+/DCOM object application using com4j and register com object programmatically.",
									"Using windows ComAdmin Objects access COM+ catalog to install and configure .NET assemblies’ security permission programmatically in C#.",
									"Using iKVM to integrate Java with .NET run-time",
									"Using .NET System.Reflection namespace to dynamically invoke ComAdmin objects methods",
									"Using open source JNA (Java Native Access) connect to win32 DLLs from java"
								],
								"technologies": ["Java",".NET 3.0/2.0/1.1","COM/DCOM","Com4j","iKVM","C#","VB.NET","JNI","JNA","Win32 DLL","COMAdmin"],
								"tags":["Java",".NET", "C++"]
							}
						},
						{
							"item-projects": {
								"title": "SaaS system integration",
								"description":"Design, development and implement integration solutions for SaaS systems (Parature, AutoTask and Zuora) based on REST/XML and web services (SOAP/WSDL) technologies.",
								"highlights":[
									"Integrate with Parature.com using its’ REST style API",
									"Integrate with AutoTask using SOAP/WSDL",
									"Integrate with Zuora using SOAP/WSDL"
								],
								"technologies": ["REST/XML","SOAP/WSDL","namespace", "DOM","soapUI" ],
								"tags":["Java","SaaS","SOA"]
							}
						},
						{
							"item-projects": {
								"title": "SAP system integration",
								"description":"Integrate with SAP NetWeaver and SAP R3 ECC 6.x via web services and librados (sapjco)",
								"highlights":[
									"Install and configure SAP NetWeaver 2006s/2007 test drive on Linux environment",
									"Research and Prototype different SAP system integration solutions",
									"Create and publish web service (SOAP/WSDL) for RFC and BAPI in SAP system using ABAP workbench",
									"Self-teaching SAP basis system in two weeks",
									"Troubleshooting librados/sapjco issues on SAP NetWeaver",
									"Design and Implement Web Services (SOAP/WSDL) solution to integrate Java to SAP RFCs",
									"Administrator SAP ABAP web services environment using SAP front-end UI."
								],
								"technologies": ["SAP R3","NetWeaver","Web Services","SOAP","WSDL","wsdl4j","SAP-JCO","RFC","BAPI","ABAP","Java"],
								"tags":["SAP","Java","", "EAI","SOA"]
							}
						}
					]
				}
			},
			{
				"item-work": {
					"start-date": "Jun., 2006",
					"end-date": "Nov.,2006",
					"position": "Senior System Engineer Manager",
					"company": {
						"name": "Vantage learning",
						"city": "Newtown, PA",
						"country": "USA "
					},
					"achievements": "As the leader in cost-effective, high volume, secure, scalable online assessment and instructional programs for K-12 and higher education, Vantage Learning leverage technology such as artificial intelligence, natural language understanding, and web-based learning objects. Vantage Learning has received accolades ranging from the prestigious CODIE Award for best instructional technology.",
					"technologies": [
					],
					"projects": [
						{
							"item-projects": {
								"title": "Large scale SOA e-learning system architecture design and blueprinting",
								"description":"Designed and blueprinted large scale SOA e-laerning system based on Java/.NET with PostgreSQL and MySQL DB clusters",
								"highlights":[
									"Researching and blueprinting SOA new technologies (WCF, WPF, XAML, AJAX, XML, SOAP, WSDL)",
									"Setup proto-type environment for distributed session in a clustering SOA system",
									"Design large-scale SOA clustering load balancing system",
									"Design integration solution for Java and .NET",
									"Researching on DB clustering environment for PostgreSQL and MySQL"
								],
								"technologies": [ "SOA","E-Learning","Struts","J2EE",".NET 2.0/3.0","Resin","SOAP","WSDL","UDDI","XML","PostgreSQL","MySQL"
								],
								"tags":["Java",".NET","SOA","DBMS","J2EE"]
							}
						},
						{
							"item-projects": {
								"title": "Large Data Center Design and Administration",
								"description":"More than 100 Unix/Linux/Windows server machines and enterprise network devices (three sets of BIP load balancers, switch and routers) data center with more 30 mission-critical applications serving millions of Internet connections.",
								"highlights":[
									"Design data center network architecture and plan budgets on new devices and spare parts",
									"Design and implement clustering and load balancing hosting environment",
									"Design and deploy large-scale SOA clustering system",
									"Deployment of clustering hosting environment with enterprise DBMS",
									"RAID 1,0,5 and SAN design and setup",
									"Veritas backup system setup and maintenance",
									"Unix and DBMS maintenance",
									"Web based system troubleshooting and debug"
								],
								"technologies": ["Solaris 5,7","Linux(Redhat,Fedora)","F5 Big-IP load balancers","Switch","Router","VLAN","UPS","RAID 1,0,5","Windows Server","Terminal server","VNC","SPARCStorage","Tape Drive","Veritas","Apache","Resin","PostgreSQL"],
								"tags":["Linux", "network", "DBMS"]
							}
						},
						{
							"item-projects": {
								"title": "Sun SPARCStorage SSA Array 100 and Sybase SQL Server (10.x, 11.x) Data (DB schema, data and Stored-Procedure) Recovery",
								"description":"Recovered important patent data and technologies from an old dead Sun SPARCStorage SSA Array with Sybase Server",
								"highlights":[
									"Troubleshooting the hardware failure of Sun SPARCStorage SSA Array",
									"Install and Configure Sybase SQL Server",
									"Use bcp, dump and load database to recover the crashed databases and stored procedure",
									"Output the SQL statements (DDL, DML) of the old data"
								],
								"technologies": ["Solaris 5,7","Linux(Redhat, Fedora)","Sybase SQL Server 10.x","Sybase ASE 11.x, 12,x 15.x","SSH", "SPARCStorage  SSA Array 100","Tape Drive"],
								"tags":["Data Recovery", "Data storage", "DBMS"]
							}
						},
						{
							"item-projects": {
								"title": "Ecommerce Open Source Software installation and Configuration",
								"description":"Installed and Configuerd the osCommerce with the x-cart and Sales-n-Stats modules in PHP and MySQL environment",
								"highlights":[
									"Install and Configure test environment for osCommerce with CREloaded on PHP, MySQL environment",
									"Install and Configure x-cart with Sales-n-Stats module on PHP, MySQL environment"
								],
								"technologies": ["Linux(Redhat, Fedora)","PHP5.x","MySQL 5.x","Apache 2.x"],
								"tags":["eCommerce", "Linux","LAMP"]
							}
						},
						{
							"item-projects": {
								"title": "Resin Application Server Distributed Session Design and Setup",
								"description":"Installed and Configuerd Resin Application Server with distributed session and http load balancer",
								"highlights":[
									"Setup resin cluster environment with distributed session enabled",
									"Setup http load balancer for resin with sticky bit"
								],
								"technologies": ["Linux(Redhat, Fedora)","resin 3.0", "Java", "Servlet", "distributed session", "cluster", "load balancer (software and hardware)"],
								"tags":["Java", "Servlet", "Cluster", "LB"]
							}
					  }
					]
				}
			},
			{
				"item-work": {
					"start-date": "May, 2002",
					"end-date": "Jun.,2006",
					"position": "Senior Programmer/Analyst and Unix System Administrator",
					"company": {
						"name": "Computer Science, Texas Tech University",
						"city": "Lubbock, Texas",
						"country": "USA"
					},
					"achievements": "System Administrator for networked Unix(Solaris, AIX, Mac OSX and Linux) and windows servers with SSO for Kerberos and LDAP, Veritas Netbackup for Disk Array with RAID 0/1/5, Migration from NIS/NIS+ to LDAP and Postfix/Sendmail conifiguration for the research and teaching lab for computer science department.",
					"technologies": [
					],
					"projects": [
						{
							"item-projects": {
								"title": "Unix network System and Software routine maintenance",
								"description":"Daily maintenance and system administration for networking Solaris, AIX and Mac OSX",
								"highlights":[
									"Troubleshooting Unix network system with multiple services (NFS, NIS+, SMTP, LDAP ...etc.) running",
									"Developed system maintenance scripts (Perl, bash …etc.)",
									"Unix Security design and analysis",
									"Compiled, Installed and configured system and development software",
									"NIS+ user accounts managements",
									"Diagnosed hardware and software problems"
								],
								"technologies": [ "Solaris 8,9,10", "Linux", "AIX", "NFS", "NIS/NIS+", "LDAP", "SMTP", "IMAP", "POP3", "WebMail", "SSH", "Samba", "Kerberos", "Netgroup", "Jumpstart", "User Accounts", "Quota", "License server", "GNU Make", "GCC", "Java", "RAID", "Tape Library", "Veritas", "Apache","MySQL","Sun Ray Server","PAM","Security","Syslog"],
								"tags":["devops","Unix","System Administration"]
							}
						},
						{
							"item-projects": {
								"title": "Setup Veritas Netbackup System with RAID0/1/5  and Tape Library",
								"description":"Setup,Administration and Backup for large Disk Array (RAID 0/1/5) Storage and virtual File system with Volume Manager",
								"highlights":[
									"Setup Veritas NetBackup Enterprise Server 5.1 on Solaris 9",
									"Setup Veritas  NetBackup client software on Linux and Solaris",
									"Designed and setup tape backup policies",
									"Installed and setup Sun StorEdge Tape Library L25 and L9",
									"Installed and setup Sun StorEdge A100 and 3300",
									"Configured hardware and software RAID 0,1 and RAID 5",
									"Setup Logical Partitions on RAID systems",
									"Setup volume and file system on the RAID system",
									"Maintained (expand partition, clean file system …etc.) a large virtual file systems. (>300GB). ",
									"Backup and restored the system and user data using Veritas software"
								],
								"technologies": ["Veritas NetBackup Enterprise Server 5.1", "Veritas NetBackup Client", "RAID 0,1,5", "SCSI", "Volume Manager", "VFS", "Tape Library"],
								"tags":["devops", "Storage", "Disk Array", "Backup", "VFS"]
							}
						},
						{
							"item-projects": {
								"title": "Setup LDAP,  Kerberos KDC and Cross-Realm system",
								"description":"Designed and Implemneted the Signle Sign On (SSO) with setup LDAP server, Kerberos KDC and Cross-Real Sytem authentication",
								"highlights":[
									"Setup SunOne Directory Server 5.2 and populate the LDAP data from NIS+ tables",
									"Setup SEAM Kerberos KDC, cross-realm authentication with Microsoft Active Directory Server",
									"Configure Kerberos and LDAP client and PAM authentication",
									"Configure SASL/GSSAPI authentication to LDAP server and identities mapping between SASL principal"
								],
								"technologies": ["SASL-2.1", "GSSAPI", "SEAM 1.2", "SunOne Directory Server 5.2", "NIS+", "LDAP V3", "PAM", "Solaris 9", "Windows Server 2003", "Active Directory"],
								"tags":["devops", "System Administration", "LDAP", "Kerberos", "authentication"]
							}
						},
						{
							"item-projects": {
								"title": "Migrated email system from UNIX mail server to Windows Exchange Server",
								"description":"Setup, Administration for SMTP servers in Solaris and Windows and Configured all different kinds of email clients for all different systems with POP3/IMAP with SSL authentication",
								"highlights":[
									"Led the email migration team and plan the email migration for whole department (more than 50 faculty/staff and more than 500 students email accounts)",
									"Configured Unix/windows mail client to connect to Microsoft exchange server via IMAP with SSL authentication",
									"Written reports and provide recommendations to Department Computer Use Committee",
									"Implemented IMPA/S mail client to Microsoft Exchange Server"

								],
								"technologies": ["Sendmail", "Postfix", "Unix Mail Client", "Outlook", "Solaris 9", "Linux", "Windows Server", "Exchange Server", "IMAP/S", "POP3/S", "SSL"],
								"tags":["System Administration", "Linux","Windows", "Mail Server/Client"]
							}
						},
						{
							"item-projects": {
								"title": "Secured Postfix SMTP server with SASL Authentication and Verification",
								"description":"Setup and configured Postfix SMTP server with SASL Authentication and Verification",
								"highlights":[
									"Compiled, installed and configured the open source openssl, perl, SASL, postfix",
									"Enable SMTP with SASL authentication for postfix",
									"Configured SASL authentication on the IMAP/POP3 Unix client side (SquirrelMail and pine)"
								],
								"technologies": ["Openssl-0.9.7", "SASL-2.1", "Postfix 2.4", "SquirrelMail", "pine", "Solaris 9", "Linux"],
								"tags":["System Administration", "SMTP Server", "email clients", "SSL", "Linux"]
							}
					  },
						{
							"item-projects": {
								"title": "Installed AIX 5.1 and configured NIM on IBM RS6000 (10x 7043-140 boxes and 1x 7024-E30 box) ",
								"description":"Setup and configured IBM AIX for RS6000 with NIM and NFS server",
								"highlights":[
									"Configured Network Interface and IP network",
									"Installed AIX 5.1 and configured NFS Server/Clients, NIS Clients",
									"Configured Network Installation Management (NIM)",
									"Deployed SORCER/Jini/Rio dynamic provisioning environment"
								],
								"technologies": ["AIX 5.1", "NIM", "NFS", "NIS/NIS+", "SORCER/Jini/Rio"],
								"tags":["System Administration", "AIX", "NIS/NIS+"]
							}
					  },
						{
							"item-projects": {
								"title": "Deployed Globus Tookit3.2.1 (OGSA/OGSI) Grid Computing Environment on Solaris 9(3 boxes) and Linux (3 boxes)",
								"description":"Setup and Configured Globus Toolkit Grid Computing Environment with SSL certificates",
								"highlights":[
									"Installed and configured OGSI core on Solaris 9 and Redhat Linux 9",
									"Installed OGSI GRAM, MDS, GSI, GridFTP and RLS on Solaris 9 and Red Hat Linux 9",
									"Configured distributing security (SSL certificate based) for Globus Toolkit 3.2.1",
									"Compiled, installed and Configured Perl on Solaris 9"
								],
								"technologies": ["Unix ( Solaris  9, Redhat Linux 9)", "NFS", "NIS/NIS+", "Perl", "PKI", "X509", "GNU Tools", "Globus Toolkit 3.2.1", "OGSA/OGSI", "GSI"],
								"tags":["Distributed System", "Scripting languages", "Unix", "Linux"]
							}
					  },
						{
							"item-projects": {
								"title": "Setup Jumpstart Environment for Solaris 9 and Solaris 10",
								"description":"Designed and Implemented the Jumpstart Environment with one installation server, one profile server and two boot servers for two different IP subnets to install and configure network, NIS+ , NFS  for more than 50 Sun client boxes. Developed Perl scripts to maintain NIS+ tables and tftp boot parameters",
								"highlights":[
									"Configured tftp and bootparamd server for the Jumpstart client machine on Solaris 9 and Solaris 10 Server",
									"Diagnosed and debug the problems related to RARP/ARP",
									"Setup Jumpstart rules, profiles, sysidcfg configuration files, begin, install and post install scripts",
									"Setup NIS+ client configuration files in the Jumpstart",
									"Developed Perl scripts to generate the entries of NIS+ tables for the client machines"

								],
								"technologies": ["Unix( Solaris  9), Jumpstart, TFTP, Bootparamd, NIS+, Perl, Security, snoop, RARP/ARP"],
								"tags":["devops","System Administration", "Scripting languages", "Unix", "Network"]
							}
					  },
						{
							"item-projects": {
								"title": "Designed and Implemented the Single Sign-On (SSO) for Unix and Windows Environments",
								"description":"Integrate the UNIX and Windows environment in a Single sign-on environment using LDAP, Kerberos, AFS, Samba technologies",
								"highlights":[
									"Designed the Single-Sign-On (SSO) Solution for computer science department",
									"Researched the feasibility of different solutions of Single sign-on (SSO)",
									"Built the test environment for the solution in Solaris 8 and 9 platform",
									"Built the GNU compiling and make environment to make the source file of samba in Solaris 9 platform",
									"Tested the Microsoft Service for Unix 3.0 for our requirement",
									"Built and Configure Samba environment",
									"Developed a customized Kerberos and AFS client with AFS home drive mapping in windows environment",
									"Compiled OpenAFS, OpenLDAP and MIT Kerberos in UNIX (Linux and Solaris) environment",
									"Setup and Configure MIT Kerberos, OpenAFS and OpenLDAP in Unix (Linux, and Solaris) environment",
									"Rebuilt MIT Kerberos with krb524 in windows environment",
									"Developed PAM module for TMP dir environment variable setting",
									"Setup PAM modules configuration file (pam.conf) in UNIX (Debian Linux and Solaris) environments"
								],
								"technologies": ["Unix( Debian Linux, Solaris 8 and 9), LDAP(OpenLDAP2.1.2","SunONE Directory Server 5.2 ","MS Active Directory)","AFS (OpenAFS 1.2.10)","Kerberos (SEAM 1.2","MIT Kerberos V 1.3.1). PAM","GSSAPI","SSL","SASL","SSH","C++","GNU make","GCC", "Visual.NET","Perl"],
								"tags":["devops","System Administration", "LDAP", "SSO", "OpenSource", "Kerberos"]
							}
					  },
						{
							"item-projects": {
								"title": "The Migration from NIS+ to LDAP for Solaris",
								"description":"Migrated the NIS+ services in Solaris 8 to LDAP (iPlanet Directory Server 5.1.) in Solaris 9. Installed, configured and implemented the test environment and designed LDAP schema to satisfy department’s requirements in the directory services. Developed Perl scripts running on Solaris 9 to fulfill user managements.",
								"highlights":[
									"Installed and Configured the Solaris 8, Solaris 9 Environment",
									"Installed and configured the iPlanet Directory Server in Solaris platform",
									"Designed the LDAP schema for department’s requirements",
									"Populated the NIS+ data to the LDAP",
									"Developed Perl scripts with LDAP enabled for user managements"
								],
								"technologies": ["Unix(Solaris 8 and 9)","LDAP( SunONE Directory Server 5.1 )","Kerberos (SEAM 1.2). NIS/NIS+","SSL","SSH","Perl","GNU make ","GCC"],
								"tags":["Authentication","System Administration", "Scripting languages", "Unix", "Network"]
							}
					  }
					]
				}
			},
			{
				"item-work": {
					"start-date": "Aug. 2002",
					"end-date": "Aug. 2006",
					"position": "Master Student",
					"company": {
						"name": "Computer Science, Texas Tech University",
						"city": "Lubbock, Texas",
						"country": "USA"
					},
					"achievements": "Stuied as Master Student in the CS department while working as part time as System Administration for the Teaching and Research labs for Unix/Linux and Windows environments",
					"technologies": [
					],
					"projects": [
						{
							"item-projects": {
								"title": "Master Thesis: A Service Wrapping and Provisioning Framework for SOA",
								"description":"Based on Jini/Rio technologies, this framework automatically generates the service wrapper codes (service dynamic smart proxy, bean wrapper and provisioning descriptions in xml format …etc.) for legacy code and autonomic provision it as a service provider (JSB - Jini Service Bean) into SOA grid environment.  A GIS based Yield Tracker system (developed in Basic language) is wrapped as service provider and provisioned into multiple Rio cyber nodes.",
								"highlights":[
								],
								"technologies": [ "Jini 2.0","RIO","JERI","Globus Toolkits 3.x","J2EE","Web Service","OpenGIS","PostGIS","JDBC","GeoServer","Struts","Ant","Tomcat","Servlet","JSP","UML2"
								],
								"tags":["Java","Distributed Computing","J2EE", "GIS"]
							}
						},
						{
							"item-projects": {
								"title": "GIS Project: A Yield Mapping and Prediction Information Delivery System",
								"description":"By using a OpenGIS project Geoserver and GIS DBMS ( PostgreSQL/ PostGIS) , the system displays a real web GIS map to the farmer. The farmer selects a particular field and other related planting information (planting date, irrigation or not, crop type) from the web map. The system uses an agriculture model (developed in Basic Language) and other information collected from satellites system in real-time to dynamically generate a web GIS based yield prediction map.",
								"highlights":[

								],
								"technologies": [ "OpenGIS","PostGIS","PostgreSQL","JDBC","GeoServer","GeoTools","Struts","Ant","Apache Maven","Servlet","JSP","MVC"],
								"tags":["Java","GIS","DBMS","PostGIS"]
							}
						},
						{
							"item-projects": {
								"title": "Independently finished practical course projects list",
								"description":"",
								"highlights":[
									"Developed a compiler which implements LL(1) grammar using c programming language. The compiler includes the lexical analysis, semantic section and symbol table, semantic stack and data structures. It supports 3-dimensions array manipulations",
									"Used Rational Rose to design Object-Oriented (OO) UML diagrams (includes use case, components diagrams, sequence and collaboration diagrams, class and package diagrams and related description documents) for the Supermarket Check-out System",
									"Developed a parallelized service provider for large-scale matrix multiplication based on SORCER environment (Jini/Rio/JavaSpace) and JBOSS",
									"Developed a block device driver and a tar file system module based on Linux kernel 2.4",
									"Developed Java card applications and OpenCard Framework (OCF) card services which include the CHV authentication and a Test application",
									"Developed a Map Navigator (run as MIDlets and RMS on MIDP device) and Map Gateway (run as servlets in servlets engine) which can send a map query to mapquest.com and display the map image on the MIDP screen to help travel"
								],
								"technologies": ["GCC Compiler","Solaris","Linux Kernel 2.4","UML 2","Rational Rose","Java","SORCER","SOA","Jini","JavaSpace","JBoss","J2EE","VFS","Java Card platform","MIDP","MIDlets","Servlets","OCF","CLDC","Ant"],
								"tags":["Java","C/C++","UML","Linux Kernel", "J2EE"]
							}
						}
					]
				}
			},
			{
				"item-work": {
					"start-date": "Apr., 2000 ",
					"end-date": "May, 2002",
					"position": "Senior Software Engineer",
					"company": {
						"name": "Technology Development Center, Sun Microsystem (China) Co.,Ltd.",
						"city": "Beijing",
						"country": "P. R. China"
					},
					"achievements": "As Senior software engineer, provided consulting services for Java/J2EE technologies for local companies. Helped design and architecture the Java/J2EE systems around Sun's software products like iPlanet Application Server, Directory Server, Message Queue Server",
					"technologies": [
					],
					"projects": [
						{
							"item-projects": {
								"title": "Java Message Service(JMS) Prototype Application",
								"description":"The prototype proves the idea of using JMS to develop a software system to implement tax documents approval process in Tax Bureau of China. Two computer nodes were deployed to emulate city node and province/state node. Each node includes JSPs as input interface to human user, Servlets as messages sender to JMS message queue, Message-Driven Beans (MDBs) act as JMS message listener to message queue and also include JDBC connectors to local DBMS. This prototype fulfills a typical JMS system which includes the message queue server and application server and DBMS.",
								"highlights":[
									"Setup Application Server, Message Queue Server, Directory Server and Oracle DB Server in tow emulation nodes",
									"Designed and developed JSP, Servlets and Message-Driven Beans",
									"Deployed the application packages (.war and .ear) in two nodes",
									"Design the test cases for the JMS prototype application"
								],
								"technologies": [ "iPlanet Application 6.0","iPlanet Directory Server","iPlanet Message Queue Server","Oracle 8.x","Solaris"," JSP","Servlet","EJB","JDBC","JNDI","LDAP","SQL","JMS","Message-Driven Bean","JMS","J2EE"
								],
								"tags":["Java","J2EE", "JMS", "DBMS"]
							}
						},
						{
							"item-projects": {
								"title": "Remote Learning Management Platform (www.ambow.com)",
								"description":"Based on J2EE technology, an e-learning platform includes course management, certificate management, and platform management subsystems as well as other useful utilities. The development of the platform was followed the RUP engineering process. UML, object-oriented analysis (OOA) and object-oriented design (OOD) technologies were used during the whole modeling process.",
								"highlights":[
									"Managed the project engineering process based on RUP",
									"Directed the whole development team (over 20 software engineers)",
									"Trained the team members with J2EE design and implementation technologies",
									"Provided Consulting Service in the system of OOA and OOD",
									"Directed Java and J2EE coding, debug and deployment in Weblogic 6.0",
									"Setup Weblogic and Oracle DBMS development environments"
								],
								"technologies": [ "Weblogic 6.0","Oracle 8.x","Windows 2000","Solaris","Rational Rose 2000","Microsoft Visual SourceSafe 6.0","JSP","Servlet","EJB","JDBC","JNDI","LDAP","SQL","Security","UML","OOA","OOD","MVC"],
								"tags":["Java","J2EE","UML"]
							}
						},
						{
							"item-projects": {
								"title": "Bao Steel B2B Website (www.bsteel.com)",
								"description":"Based on the blueprint of the J2EE's sample program (Pet store) which implemented the MVC pattern, the first large-scale B2B website in China consists of more than ten modules such as User Manager, DB Manager, Auction, Products, Ordering, Bargaining, Communication, …etc. and more than 100 tables.",
								"highlights":[
									"Set up the iPlanet App Server development and test environment in Solaris platform",
									"Provide Consulting Services in the development of bargaining module (Includes 2 session beans and over 10 JSPs and many other helper classes)",
									"Analyzed, designed, developed and deployed auction module (Includes 6 EJBs and over 20 JSPs and many other helper classes such as value-object etc.)",
									"Directed the Java coding and deployment in iPlanet App Server 6.0",
									"Setup Oracle DB server for development and production environments",
									"Setup CVS system on Solaris platform"
								],
								"technologies": ["iPlanet Application Server 6.0","iPlanet Directory Server 4.1","iPlanet Web Server 4.1","Oracle 8.1.5","Solaris 2.7","Window NT 4.0-Sp6","Jakarta Ant 1.1","CVS","JSP","Servlets","EJB","JDBC","JNDI","LDAP","SQL","Security"],
								"tags":["Java","J2EE","Unix", "Windows", "SQL"]
							}
						},
						{
							"item-projects": {
								"title": "Project Management Tools",
								"description":"Run on iPlanet Application Server (iAS) 6.0 platform, the tools provide the web-based functionalities such as project management, user management, document management and resources management.  The user management module is LDAP-based authentication and session-based authorization. A CORBA (JavaIDL) server provides the SCC and file accessing in local machine for EJBs (CORBA client) in iAS6.0. These tools include 30 Servlets, 20 JSPs, 10 EJBs and some other helper classes",
								"highlights":[
									"Set up and administered the development of iPlanet App Server 6.0",
									"Designed, developed and deployed the LDAP based user management module",
									"Designed and developed the CORBA based project management tool",
									"Designed the Security and Transaction of the whole project"
								],
								"technologies": ["iPlanet Application Server 6.0","iPlanet Directory Server 4.1","iPlanet Web Server 4.1","Oracle 8.1.5","Solaris 2.7"," JSP","Servlet","EJB","JDBC","Java IDL","CORBA","JNDI","LDAP","SQL","Security"],
								"tags":["Java","J2EE","CORBA", "IDL", "SQL"]
							}
						}

					]
				}
			},
			{
				"item-work": {
					"start-date": "Aug.,1998",
					"end-date": "Apr.,2000",
					"position": "Software Engineer",
					"company": {
						"name": "IBM China Research and Development Lab",
						"city": "Beijing",
						"country": "P. R. China"
					},
					"achievements": "As software engineer, designed and implemented Java/J2EE systems around IBM software products like IBM WebSphere ...etc.",
					"technologies": [
					],
					"projects": [
						{
							"item-projects": {
								"title": "Credit Card Internet Online Payment System",
								"description":"Based on the existing POS payment system supported by ICBC(Industrial and Commercial Bank of China), a credit card online payment system was developed and deployed using IBM Payment Server, Net.Commerce (previous version of IBM WebSphere Commerce Suite), WebSphere Application server. Payment Server connected to ICBC POS front server via encrypted communication by using a serial (COM port) interface software module which emulates the typical POS credit card operation for the internet online user.",
								"highlights":[
									"Analyzed the requirements of interface software",
									"Developed and implemented the communication module(C lib) with POS",
									"Designed and developed COM port interface module using javax.comm",
									"Developed and deployed the interface module (servlets) in the WebSphere Application Server between Net.Commerce and PaymentServe",
									"Followed SDLC process to design, develop and test the system",
									"Written SDLC documents during design, development and testing phase"
								],
								"technologies": [ "WebSphere Application Server","Net.Commerce","Payment Server","DB2","WinNT Server","JSP","Servlet","Security","SSL","JDBC","C","Socket and Serial Communication Programming","javax.comm","SDLC"
								],
								"tags":["Java","J2EE", "DBMS","SSL", "C"]
							}
						},
						{
							"item-projects": {
								"title": "Jiro/Jini-based Storage Management System",
								"description":"Based on Jiro/Jini technology, developed a distributed management system for SAN.",
								"highlights":[
									"Analyzed requirements of the SAN (Storage Area Network) system",
									"Participated in the system prototype design and development",
									"Developed web-based management client for the system which include some servlets connecting to the Jini services (Management Facade- MF)"
								],
								"technologies": [ "Apache1.3","JDK1.2.x","Solaris 2.7","JSP","Servlet","Jiro/jini","RMI","SAN"],
								"tags":["Java","Distributed Computing", "Disk Storage", "OpenSource"]
							}
						},
						{
							"item-projects": {
								"title": "Handwriting Recognizing System",
								"description":"Using Java JNI, MFC, Lotus Domino, LS:DO, RDO:ODBC and DB2, developed a handwriting recognition testing, research environment for IBM ThinkScribe. It includes a web-based client (servlets communicate with ThinkScribe Driver via JNI), DB accessing (LS:DO and RDO:ODBC) and stand-alone application client (MFC)",
								"highlights":[
									"Anylisis the requirements and design the system",
									"Set up Lotus Domino R5 web environment and developed lotus script agents querying the data in DB2 through LS:DO",
									"Developed MFC application connecting to DB2 via RDO:ODBC",
									"Developed the Java class calling the handwriting recognition engine (.Dll) via JNI"
								],
								"technologies": ["Lotus Domino R5","Visual Basic 6.0","DB2","WinNT-sp5","Lotus Notes","MS-IE","JSP","Servlet","Lotus Script","LS:DO","RDO:ODBC","Visual Basic","MFC"],
								"tags":["Java","J2EE","JNI", "Windows", "Lotus"]
							}
						}
					]
				}
			},
			{
				"item-work": {
					"start-date": "Apr.,1996",
					"end-date": "Jul.,1997",
					"position": "System/Network/Software Engineer",
					"company": {
						"name": "North China Institute (Taiji Computers Corporation)",
						"city": "Beijing",
						"country": "P. R. China"
					},
					"achievements": "Worked for different teams as System/Network/Software Engineer. Provided production supporting services for IBM RS6000 and Disk Array products. Developed IC Card Application system. Designed Large scale network system with Cisco Router and Switches.",
					"technologies": [
					],
					"projects": [
						{
							"item-projects": {
								"title": "System Engineer,IBM Service Center",
								"description":"This service center is the joint department of IBM and Taiji Computers Company. It provides professional technical supports for IBM RS6000 and IBM Disk Array Products.",
								"highlights":[
									"Installed Software in RS6000/AIX",
									"Setup HACMP software in RS6000/AIX system",
									"Troubleshooting RS6000 and IBM disk array (SCSI, SSA) hardware system",
									"Troubleshooting software problems in AIX system",
									"Installed and Maintained IBM RS6000 and IBM Disk Array (SCSI and SSA) Products hardware",
									"Setup volume, logical partition, Journal file system and RAID 0,1,5 on IBM Disk Array Products"
								],
								"technologies": [ "IBM RS6000 (SP2, R50, ..., 43P)","AIX","IBM Disk Array","AIX","TCP/IP","HACMP","RAID0,1,5","SCSI. JFS","SSA","Volume Manager","Logical/Physical Partition"
								],
								"tags":["System Administration","Disk Storage", "RAID", "SCSI", "AIX"]
							}
						},
						{
							"item-projects": {
								"title": "Software Engineer, HUAXU Golden Card Co.Ltd.",
								"description":"Developed IC (Integrated Circuit) Card related hardware and IC Card application system",
								"highlights":[
									"Developed IC Card (includes Memory, Security and CPU) Application System",
									"Developed IC Card Reader Application System",
									"Developed IC Card Reader Driver Application (DLL) using C++ (BC++ and VC++) on windows platform",
									"Developed IC Card Reader GUI user Application using Visual Basic on windows platform",
									"Designed and Developed IC Card Information Management System using FoxPro, PowerBuilder and Perl on Windows Platform"
								],
								"technologies": [ "ATMEL Chips","Motorola","Memory/Security/CPU Card. M51 (Single Chip Computer). Visual C++","Visual Basic","Borland C++","Power Builder","Widows NT","C++","DLL","Lib","COS (Chip OS)","DES","Assembly Language","FoxPro"],
								"tags":["C/C++","IC", "DLL"]
							}
						},
						{
							"item-projects": {
								"title": "Large scale Network System Design and Administion",
								"description":"Designed large-scale network system plan and implemented the network system (hardware installation, Data link layer and IP layer configuration) with fiber network products (Cisco, IBM ATM and 3Com)",
								"highlights":[
									"People's Bank of China (The Central Bank of China) ATM network system design and implementation (ATM 622M, ELAN, VLAN, CISCO Router 7500)",
									"China Investment Bank WAN network system",
									"JiNan, ShanDong Province Broadcast & TV network system (HFC)",
									"ATM Network system of Beijing People's Broadcast Station (IBM 8285, Cisco 7500)",
									"PICC Property of Tianjin network system (IBM 8274,8273,Cisco 2511)",
									"PICC Property of LiaoNing and ShenYang Network system",
									"PICC Property of HeiLongJiang Network System (IBM 8260,8274, 8271),Notes: PICC - People's Insurance Company of China",
									"Responsible for network project design, implementation and plan",
									"Provided system (IBM RS6000, PC Server, AIX, SCO UNIX, NT, Informix) integration plans for customers",
									"Achieved the certificate of IBM advanced networking training and networking hands-on training",
									"Configured RIP, OSPF routing protocol in Cisco Routers via IOS",
									"Detailed Design ELAN and VLAN with IP subnet",
									"Configured ELAN, VLAN in IBM ATM Switch",
									"Configured IP WAN in Cisco Router",
									"Configured Ethernet, Token-Ring, X.25, ISDN, Frame-Relay and other data layer network",
									"IBM Network Products hardware installation and repair",
									"Installed Cisco and 3Com network products (Router, Switch, and Fiber Products)"
								],
								"technologies": ["IBM 8265/8285/8274","Cisco Router 7500","Cisco 2511","ATM","ELAN","VLAN","HFC","RIP","OSPF","Cisco IOS","X.25","Frame-Relay","ISDN","Ethernet"],
								"tags":["System Administrion","Network Design"]
							}
						}
					]
				}
			},
			{
				"item-work": {
					"start-date": "Jun., 1991",
					"end-date": "Sep.,1993",
					"position": "Mechanical Manufacture Engineer",
					"company": {
						"name": "Yongji Electrical and Motor Factory",
						"city": "ShanXi Province",
						"country": "P. R. China"
					},
					"achievements": "",
					"technologies": [
					],
					"projects": [
						{
							"item-projects": {
								"title": "CIMS and FMS CAPP/CAD/CAM manufacturing Automcation application development",
								"description":"Locomotive's motor and generator related mechanical products design and manufacturing processing. Programming on FMS/CIM manufacture centers from GE (General Electric)",
								"highlights":[
									"Mechanical engineer of locomotive's motor and generator",
      						"Developed CAPP, CAD software of CIMS system(C, C++, AutoCAD)",
      						"Designed and implemented the manufacturing process of mechanical component in locomotive"
								],
								"technologies": [ "AutoCAD", "C", "C++", "DOS", "Z80(Single Chip Computer)","Borland C++"
								],
								"tags":["C/C++", "AutoCAD"]
							}
						}
					]
				}
			}
		],
		"skills": [
		],
		"languages": [
			{
				"item-languages": {
					"name": "",
					"additional-info": ""
				}
			},
			{
				"item-languages": {
					"name": ""
				}
			}
		],
		"hobbies": [
			{
				"item-hobbies": {
					"name": ""
				}
			},
			{
				"item-hobbies": {
					"name": "",
					"additional-info": ""
				}
			},
			{
				"item-hobbies": {
					"name": "",
					"additional-info": ""
				}
			}
		]

	}
}
